#include <stdio.h>

int main() {

	char a[] = "I Love C";
	int b[] = { 1, 2, 3, 4, 5 };
	float c[] = { 1.1, 2.2, 3.3, 4.4, 5.5 };
	double d[] = { 1.1, 2.2, 3.3, 4.4, 5.5 };

	//数组中相邻两个元素地址相差和元素的类型相关
	printf("a[0] -> %p, a[1] -> %p, a[2] -> %p, a[3] -> %p\n", &a[0], &a[1], &a[2], &a[3]);
	printf("b[0] -> %p, b[1] -> %p, b[2] -> %p, b[3] -> %p\n", &b[0], &b[1], &b[2], &b[3]);
	printf("c[0] -> %p, c[1] -> %p, c[2] -> %p, c[3] -> %p\n", &c[0], &c[1], &c[2], &c[3]);
	printf("d[0] -> %p, d[1] -> %p, d[2] -> %p, d[3] -> %p\n", &d[0], &d[1], &d[2], &d[3]);
}