#include <stdio.h>

int main(void) {

	int a = 1;
	char b = 'A';
	double c = 1.0;
	int d = 100;
	int e = -100;
	//格式声明:由%和格式字符组成
	//由于在计算机中所有数据都是以二进制形式存储的
	//所有它的作用是将输出的数据转换为指定的格式输出
	//普通字符将原样输出，如换行符\n

	//%d输出十进制整数
	printf("%d\n", a); //1

	//%5d指定输出数据占5列
	printf("%5d\n", a); //    1 , 1的前面将会有4个空格

	//%c用来输出一个字符
	printf("%c\n", b); //A
	
	//%f用来输出一个单精度浮点型
	printf("%f\n", c); //1.000000

	//%e指定以指数形式输出实数
	printf("%e\n", 111.111); //1.111110e+02
	
	//%i作用与d格式相同
	printf("%i\n", d);  //100

	//%o 以八进制整数形式输出
	printf("%o\n", d); //144

	//%x以十六进制形式输出整数
	printf("%x\n", d); //64

	//%u输出无符号型数据，以十进制整数形式输出
	printf("%u\n", e); //4294967196
	return 0;
}